const projectsInfo = {
    "humster-light": {
        text: "Приложение-кликер. На интерфейсе отображается кнопка с изображением хомяка. При нажатии на кнопку, пользователь зарабатывает монеты (по 1, по 5, по 10 на ваш выбор). Также, при нажатии на кнопку, уменьшается запас энергии хомяка. Если энергии нет, то монеты не зарабатываются. Также, в зависимости от количества монет меняется цвет кнопки. Изначально она синяя, если монет становится 50 кнопка становится зеленой, а при 100 монетах - фиолетовой. Изначально запас энергии 200 единиц, при каждом клике он уменьшается на 1,5,10 единиц (на ваш выбор)."
    }
}